package ru.urfu.chucknorrisdemo.data.mock

import ru.urfu.chucknorrisdemo.domain.model.FactEntity

object MockData {
    val facts = listOf(
        FactEntity(
            name = "Сталинградская битва",
            startYear = 1942,
            endYear = 1943,
            imageUrl = "https://cdnn21.img.ria.ru/images/07e6/07/06/1800744286_0:167:3001:1855_1920x0_80_0_0_8cfb967f89e87d71b1511adeae24fbb4.jpg",
            description = "Летом 1942 года началась невиданная по своему значению, размаху и напряжению битва на подступах к Дону и Волге. 200 дней и ночей Красная Армия перемалывала отборные соединения Германии и её союзников. Сталинградская битва, которая изменила историю и переломила ход всей Второй мировой войны, продлилась с 17 июля 1942 года по 2 февраля 1943 года и закончилась полной победой советских войск. Оборонительный этап операции продолжался до 18 ноября 1942 года, а с 19 ноября начался наступательный этап."
        ),
        FactEntity(
            name = "Оборона Севастополя",
            startYear = 1941,
            endYear = 1942,
            imageUrl = "https://news.store.rambler.ru/img/a6322db13cd1719396c089ea652ef6fb?img-format=auto&img-1-resize=height:400,fit:max&img-2-filter=sharpen",
            description = "Севастополь — город русской славы. Во время Крымской войны XIX века наши воины обороняли главную военно-морскую базу Черноморского флота 349 дней. В годы Великой Отечественной Севастополь держался 250 дней и ночей (с 30 октября 1941 года по 4 июля 1942 года). В обоих случаях защитникам города противостояли превосходящие силы врага: в Крымскую войну — англичане, французы, турки, сардинцы, в 1941–1942 годах — отборные соединения 11-й немецкой армии Эриха фон Манштейна и румынские дивизии."
        ),
        FactEntity(
            name = "Курская битва",
            startYear = 1943,
            endYear = 1943,
            imageUrl = "https://cdnn21.img.ria.ru/images/149932/68/1499326846_98:0:2829:2048_1920x0_80_0_0_19e07a80e4129830c4242149adb8a1ed.jpg",
            description = "Важнейшим событием всей Великой Отечественной войны стала битва на Курской дуге летом 1943 года. Планы командования вермахта окружить и уничтожить советские войска на Курском выступе были разрушены. Красная Армия сама перешла в контрнаступление и нанесла тяжёлое поражение противнику. Курскую битву многие историки считают завершением коренного перелома в войне."
        ),
        FactEntity(
            name = "Операция Багратион",
            startYear = 1944,
            endYear = 1944,
            imageUrl = "https://cdnn21.img.ria.ru/images/155611/22/1556112234_502:0:2550:2048_1920x0_80_0_0_783848dc6c2d8ea22b5f1c2715aeb90e.jpg",
            description = "Белорусская стратегическая наступательная операция Красной Армии (23 июня – 29 августа 1944 года) с кодовым наименованием «Багратион» стала примером военного искусства. Она же была главным событием на советско-германском фронте в 1944 году. Наши войска освободили Белоруссию, большую часть Литвы, восточные районы Польши. Красная Армия нанесла удар, вектор которого был направлен к центру германского нацизма — на Берлин. В моральном плане операция «Багратион» стала возмездием за поражения наших войск в Белоруссии летом 1941 года."
        ),
        FactEntity(
            name = "Битва за Москву",
            startYear = 1941,
            endYear = 1942,
            imageUrl = "",
            description = "Битва за Москву — первое решающее сражение Великой Отечественной войны. Столица СССР имела стратегическое значение: от результата сражения за Москву зависел исход войны. При защите главного города нашей Родины тысячи бойцов и командиров проявили невиданный героизм. Начав осенью 1941 года поход на Москву при подавляющем преимуществе в войсках и технике, немецкие полчища были разбиты и отброшены. Весь мир увидел, что Красная Армия не сломлена, она способна побеждать. Советские люди воспрянули духом."
        ),
    )
}